app/Controllers/Cadastrar.php

INSERT INTO `users` (`nome`, `email`, `senha`) VALUES ('camila', 'camila@gmail.com', '123')
---
    public function store()
    {

        $user = new User();
        $inserted = $user->insert($this->request->getPost());